Continued apply output from previous comment.
<details><summary>Show Output</summary>

```diff
8a99.zip" -> "builds/6f4cf68516abc051e67e5cb23463a2ccd3bead59fb820968d7d663550d6a6f86.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/cd1fb28f2c60c471e4a371aa1e6a5536494d9d48d8b115c51e92cfdae67c8a99.zip" -> "builds/6f4cf68516abc051e67e5cb23463a2ccd3bead59fb820968d7d663550d6a6f86.zip"
      - tags                          = {} -> null
      ~ tags_all                      = {} -> (known after apply)
      + version_id                    = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.python_libraries_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/layers/python_libraries/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/6f4cf68516abc051e67e5cb23463a2ccd3bead59fb820968d7d663550d6a6f86.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/6f4cf68516abc051e67e5cb23463a2ccd3bead59fb820968d7d663550d6a6f86.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.python_libraries_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "695903073955692748" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/cd1fb28f2c60c471e4a371aa1e6a5536494d9d48d8b115c51e92cfdae67c8a99.zip" -> "builds/6f4cf68516abc051e67e5cb23463a2ccd3bead59fb820968d7d663550d6a6f86.zip"
          ~ "timestamp" = "1750300639330858000" -> "1750304498283623000"
        }
    }

  # module.pgxflow[0].module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7405780631018158752" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300213051785000" -> "1750304495423662000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-admin.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-admin"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:7",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-admin.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7437137673356702548" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300213169315000" -> "1750304486239006000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-data-portal.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-dataPortal"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:7",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-data-portal.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5681270177510769544" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300212377827000" -> "1750304485086757000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-deidentifyFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-deidentifyFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:7",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_binaries_layer:9",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "428395623648074612" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300213769200000" -> "1750304486176021000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-generateCohortVCfs"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:7",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_binaries_layer:9",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4941005638243018095" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300212442131000" -> "1750304486356110000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-generateReports.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7898002292486652474" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300211634806000" -> "1750304485877991000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getAnalyses.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getAnalyses"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:7",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5570787560365016711" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300212276084800" -> "1750304485937924000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getBiosamples.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getBiosamples"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:7",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7817725181243332357" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300213665577800" -> "1750304486480702000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getConfiguration.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getConfiguration"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:7",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7967290707199585218" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300212772765000" -> "1750304485261010000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getDatasets.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getDatasets"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:7",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getDatasets.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "336307117043151547" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300212680883800" -> "1750304485945422800"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getEntryTypes.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getEntryTypes"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:7",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1231062824382790311" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300211335020000" -> "1750304484752168800"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getFilteringTerms.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getFilteringTerms"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:7",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4870541800078495713" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300213245112000" -> "1750304484926303000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getGenomicVariants.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getGenomicVariants"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:7",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5408197854940249972" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300212720436000" -> "1750304486374982200"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getIndividuals.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getIndividuals"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:7",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7655693547730884748" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300213178819800" -> "1750304485819295000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getInfo.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getInfo"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:7",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getInfo.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8953036514929914265" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300213232810000" -> "1750304485728579000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getMap.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getMap"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:7",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getMap.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8092755982344235242" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300212647770000" -> "1750304485037127000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getProjects.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getProjects"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:7",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getProjects.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1290608943353002825" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300212428330800" -> "1750304485663984000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getRuns.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getRuns"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:7",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getRuns.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "498935544522382063" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300213641574000" -> "1750304485137967200"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-indexer.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-indexer"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:7",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-indexer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "9065059751015139106" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300213820609000" -> "1750304485973568000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-performQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-performQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_binaries_layer:9",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:7",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-performQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2915305304470768037" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300211738847000" -> "1750304486047555000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-splitQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-splitQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:7",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1950578876444559891" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300213275596000" -> "1750304485044319000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-updateFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-updateFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_binaries_layer:9",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:7",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8217383638540509324" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300211438754000" -> "1750304485847600000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.python_libraries_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:7" -> (known after apply)
      ~ code_sha256                 = "XFHmNgmhdnqOlynetOZqS/AC4sy+vF96XtvqJrm05QY=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-06-19T02:48:59.539+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:7" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer" -> (known after apply)
      ~ s3_key                      = "builds/39b0ceba9439713c5c07b8fc1c05101d3f100159e1a5092a19fb6e1e04792304.zip" -> "builds/7beefda982f5be371382d0ff4063670f0aeff8f7b2fa9c29f46b42a0b3a901ba.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 23696010 -> (known after apply)
      ~ version                     = "7" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::gaspi-lambda-layers-20250619023050292900000004/builds/39b0ceba9439713c5c07b8fc1c05101d3f100159e1a5092a19fb6e1e04792304.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "e4b811492aaca54838f466ce4cb29602-5" -> (known after apply)
      ~ id                            = "builds/39b0ceba9439713c5c07b8fc1c05101d3f100159e1a5092a19fb6e1e04792304.zip" -> (known after apply)
      ~ key                           = "builds/39b0ceba9439713c5c07b8fc1c05101d3f100159e1a5092a19fb6e1e04792304.zip" -> "builds/7beefda982f5be371382d0ff4063670f0aeff8f7b2fa9c29f46b42a0b3a901ba.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/39b0ceba9439713c5c07b8fc1c05101d3f100159e1a5092a19fb6e1e04792304.zip" -> "builds/7beefda982f5be371382d0ff4063670f0aeff8f7b2fa9c29f46b42a0b3a901ba.zip"
      - tags                          = {} -> null
      + version_id                    = (known after apply)
        # (14 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/layers/python_libraries/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/7beefda982f5be371382d0ff4063670f0aeff8f7b2fa9c29f46b42a0b3a901ba.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/7beefda982f5be371382d0ff4063670f0aeff8f7b2fa9c29f46b42a0b3a901ba.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.python_libraries_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2616520953364042401" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/39b0ceba9439713c5c07b8fc1c05101d3f100159e1a5092a19fb6e1e04792304.zip" -> "builds/7beefda982f5be371382d0ff4063670f0aeff8f7b2fa9c29f46b42a0b3a901ba.zip"
          ~ "timestamp" = "1750301329559400000" -> "1750304496717553000"
        }
    }

  # module.sbeacon.module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7527274506783455722" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300212846689000" -> "1750304484746220200"
            # (1 unchanged element hidden)
        }
    }

  # module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6286544609707883523" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300213676580000" -> "1750304484883471000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8372722209999866716" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300211752601000" -> "1750304497641901000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-getResultsURL.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "9094693279551011946" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300211684200000" -> "1750304497633950000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5774305104271963983" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300212271827000" -> "1750304497629376000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-initLookup.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5138863434533339837" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300213055250000" -> "1750304497786314000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5682274019171982664" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300211431375000" -> "1750304497787231000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-sendJobEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7764746219925180592" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300211536056000" -> "1750304497856439200"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5060456204089939615" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300213219245000" -> "1750304497653606000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-getResultsURL.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "74080681236050336" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300213924326800" -> "1750304498170984000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-gnomad.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3016171251340302485" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300212140567000" -> "1750304498037343000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-initPharmcat.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5800146309871923319" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300211949599000" -> "1750304498232101000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-postprocessor"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:pgxflow_backend_python_modules_layer:1",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:pgxflow_backend_python_libraries_layer:1",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:pgxflow_backend_binaries_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7025562325096826746" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300213549415200" -> "1750304497926670000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-sendJobEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2331240722775444625" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300213459579000" -> "1750304498030924000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6025664857401438406" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750300212248422000" -> "1750304498078191000"
            # (1 unchanged element hidden)
        }
    }

Plan: 57 to add, 24 to change, 52 to destroy.
module.webgui.terraform_data.cloudfront-version-invalidate: Destroying... [id=39552c18-a373-6b39-aaef-8804d36b250b]
module.webgui.terraform_data.cloudfront-version-invalidate: Destruction complete after 0s
module.webgui.null_resource.cloudfront-invalidate: Destroying... [id=456028936625806955]
module.webgui.null_resource.cloudfront-invalidate: Destruction complete after 0s
module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0]: Creating...
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0]: Provisioning with 'local-exec'...
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] (local-exec): Executing: ["python3" ".terraform/modules/sbeacon.lambda-updateFiles/package.py" "build" "--timestamp" "1750304485847600000" "builds/c9aeb352ba865d75525b04f41669122fd57b4050d0247ae84632e4cb48ffe7ec.plan.json"]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.null_resource.archive[0]: Provisioning with 'local-exec'...
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): Executing: ["python3" ".terraform/modules/pgxflow.pipeline_pharmcat.lambda-updateReferenceFiles/package.py" "build" "--timestamp" "1750304498078191000" "builds/87d47c3a7a19e48e88e0ad96574f23db04eac6b3b01ba350d7b96e2966fa3be8.plan.json"]
module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.null_resource.archive[0]: Provisioning with 'local-exec'...
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0]: Provisioning with 'local-exec'...
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0]: Creating...
module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): Executing: ["python3" ".terraform/modules/pgxflow.pipeline_lookup.lambda-updateReferenceFiles/package.py" "build" "--timestamp" "1750304497653606000" "builds/23c1c917d91841728fbe19181191ba4ce10dac51e9255b6cadb09864299463dc.plan.json"]
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] (local-exec): Executing: ["python3" ".terraform/modules/cognito.lambda-logEmailDelivery/package.py" "build" "--timestamp" "1750304486186081000" "builds/a8f4f52fd2bf74768358bcc93ef19fd9d4225b9b50c6d2604117f5d6f0ff138a.plan.json"]
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): Executing: ["python3" ".terraform/modules/sbeacon.lambda-deidentifyFiles/package.py" "build" "--timestamp" "1750304486176021000" "builds/672ae45c60f0461434bc17038314858de743dca5f8d958239db8ac1f979f96eb.plan.json"]
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] (local-exec): Executing: ["python3" ".terraform/modules/security.lambda-sendSecurityAlert/package.py" "build" "--timestamp" "1750304484883471000" "builds/a5192d6c6931daa312a9d5196c8dd48db9f131a2a75a71add835dc60c9c5671f.plan.json"]
module.webgui.null_resource.s3-upload: Destroying... [id=4772541498151650759]
module.webgui.null_resource.s3-upload: Destruction complete after 0s
module.pgxflow[0].module.pipeline_lookup.module.lambda-initLookup.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getRuns.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getRuns.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): Executing: ["python3" ".terraform/modules/sbeacon.lambda-getRuns/package.py" "build" "--timestamp" "1750304485137967200" "builds/878658a187063e4dfad870e9be4e49fd58ec8f23eb5632950dba4c4c8d05184c.plan.json"]
module.pgxflow[0].module.pipeline_lookup.module.lambda-initLookup.null_resource.archive[0]: Provisioning with 'local-exec'...
module.pgxflow[0].module.pipeline_lookup.module.lambda-initLookup.null_resource.archive[0] (local-exec): Executing: ["python3" ".terraform/modules/pgxflow.pipeline_lookup.lambda-initLookup/package.py" "build" "--timestamp" "1750304497786314000" "builds/33ca5d9bf1f90b78aa601543d8713042e872e5f98f0d4d91dc9d2b2edea6d2fb.plan.json"]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: creating 'builds/87d47c3a7a19e48e88e0ad96574f23db04eac6b3b01ba350d7b96e2966fa3be8.zip' archive
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/203/default/pgxflow/pipeline_pharmcat/lambda/updateReferenceFiles
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: pharmcat.py
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: pharmcat.sh
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: version_checks.py
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): Created: builds/87d47c3a7a19e48e88e0ad96574f23db04eac6b3b01ba350d7b96e2966fa3be8.zip
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.null_resource.archive[0]: Creation complete after 1s [id=1819454515673216719]
module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0]: Creating...
module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0]: Provisioning with 'local-exec'...
module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0] (local-exec): Executing: ["python3" ".terraform/modules/cognito.lambda-sendClinicJobEmail/package.py" "build" "--timestamp" "1750304486457757000" "builds/610658c213211425fcee62511af74a9d74acc7617b3e44e0707f4a3c81b6dfe8.plan.json"]
module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: creating 'builds/23c1c917d91841728fbe19181191ba4ce10dac51e9255b6cadb09864299463dc.zip' archive
module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/203/default/pgxflow/pipeline_lookup/lambda/updateReferenceFiles
module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: dbsnp.py
module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: dbsnp.sh
module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: version_checks.py
module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): Created: builds/23c1c917d91841728fbe19181191ba4ce10dac51e9255b6cadb09864299463dc.zip
module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.null_resource.archive[0]: Creation complete after 1s [id=1961319673397733416]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-getResultsURL.null_resource.archive[0]: Creating...
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-getResultsURL.null_resource.archive[0]: Provisioning with 'local-exec'...
module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0] (local-exec): zip: creating 'builds/610658c213211425fcee62511af74a9d74acc7617b3e44e0707f4a3c81b6dfe8.zip' archive
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-getResultsURL.null_resource.archive[0] (local-exec): Executing: ["python3" ".terraform/modules/pgxflow.pipeline_pharmcat.lambda-getResultsURL/package.py" "build" "--timestamp" "1750304498170984000" "builds/d2df92fff5a868bbdcaf874e61c535d70bbb9fa96753eef0590fbd1a82bdae0a.plan.json"]
module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0] (local-exec): Installing python requirements: cognito/lambda/sendClinicJobEmail/requirements.txt
module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0] (local-exec): > mktemp -d terraform-aws-lambda-XXXXXXXX # /tmp/terraform-aws-lambda-cn1_kfgi
module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0] (local-exec): > cd /tmp/terraform-aws-lambda-cn1_kfgi
module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0] (local-exec): > python3.12 -m pip install --no-compile --prefix= --target=. --requirement=requirements.txt
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] (local-exec): zip: creating 'builds/a8f4f52fd2bf74768358bcc93ef19fd9d4225b9b50c6d2604117f5d6f0ff138a.zip' archive
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/203/default/cognito/lambda/logEmailDelivery
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] (local-exec): Created: builds/a8f4f52fd2bf74768358bcc93ef19fd9d4225b9b50c6d2604117f5d6f0ff138a.zip
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0]: Creation complete after 1s [id=1669034735071621660]
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] (local-exec): zip: creating 'builds/c9aeb352ba865d75525b04f41669122fd57b4050d0247ae84632e4cb48ffe7ec.zip' archive
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/203/default/sbeacon/lambda/updateFiles
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] (local-exec): zip: creating 'builds/a5192d6c6931daa312a9d5196c8dd48db9f131a2a75a71add835dc60c9c5671f.zip' archive
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] (local-exec): Created: builds/c9aeb352ba865d75525b04f41669122fd57b4050d0247ae84632e4cb48ffe7ec.zip
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/203/default/security/lambda/sendSecurityAlert
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] (local-exec): zip: adding: inspector.py
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] (local-exec): Created: builds/a5192d6c6931daa312a9d5196c8dd48db9f131a2a75a71add835dc60c9c5671f.zip
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): Executing: ["python3" ".terraform/modules/sbeacon.lambda-getIndividuals/package.py" "build" "--timestamp" "1750304485819295000" "builds/8c371ff12e5136df162e9fa7bcb5926be18d4b1fce0bfba3ac4489ef1eef43cf.plan.json"]
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): zip: creating 'builds/672ae45c60f0461434bc17038314858de743dca5f8d958239db8ac1f979f96eb.zip' archive
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0]: Creation complete after 1s [id=4430933775781765454]
module.pgxflow[0].module.pipeline_lookup.module.lambda-initLookup.null_resource.archive[0] (local-exec): zip: creating 'builds/33ca5d9bf1f90b78aa601543d8713042e872e5f98f0d4d91dc9d2b2edea6d2fb.zip' archive
module.pgxflow[0].module.pipeline_lookup.module.lambda-initLookup.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/203/default/pgxflow/pipeline_lookup/lambda/initLookup
module.pgxflow[0].module.pipeline_lookup.module.lambda-initLookup.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.pgxflow[0].module.pipeline_lookup.module.lambda-initLookup.null_resource.archive[0] (local-exec): Created: builds/33ca5d9bf1f90b78aa601543d8713042e872e5f98f0d4d91dc9d2b2edea6d2fb.zip
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0]: Creation complete after 1s [id=2222324627247828874]
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/203/default/sbeacon/lambda/deidentifyFiles
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): zip: adding: deidentification.py
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): zip: adding: file_validation.py
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): zip: adding: launch_ec2.py
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): Created: builds/672ae45c60f0461434bc17038314858de743dca5f8d958239db8ac1f979f96eb.zip
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0]: Creating...
module.pgxflow[0].module.pipeline_lookup.module.lambda-initLookup.null_resource.archive[0]: Creation complete after 0s [id=979012218675586596]
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): Executing: ["python3" ".terraform/modules/sbeacon.lambda-getBiosamples/package.py" "build" "--timestamp" "1750304486480702000" "builds/c10b05ac79a1543791452349cd94dc0becdd627b0c882c67a4f1c485c502d92c.plan.json"]
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0]: Creation complete after 1s [id=2131316364138734361]
module.sbeacon.module.lambda-getProjects.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-data-portal.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: creating 'builds/878658a187063e4dfad870e9be4e49fd58ec8f23eb5632950dba4c4c8d05184c.zip' archive
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/203/default/sbeacon/lambda/getRuns
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: adding: route_runs.py
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: adding: route_runs_filtering_terms.py
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: adding: route_runs_id.py
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: adding: route_runs_id_analyses.py
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: adding: route_runs_id_g_variants.py
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): Created: builds/878658a187063e4dfad870e9be4e49fd58ec8f23eb5632950dba4c4c8d05184c.zip
module.sbeacon.module.lambda-getProjects.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): Executing: ["python3" ".terraform/modules/sbeacon.lambda-getProjects/package.py" "build" "--timestamp" "1750304485663984000" "builds/aa396856c56bc316f5429db8c17f42525a5333058192b85978c8cc8f4bb30bfe.plan.json"]
module.webgui.aws_s3_object.version: Modifying... [id=version.txt]
module.sbeacon.module.lambda-getRuns.null_resource.archive[0]: Creation complete after 0s [id=5419749541747724086]
module.sbeacon.module.python_modules_layer.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-data-portal.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-data-portal.null_resource.archive[0] (local-exec): Executing: ["python3" ".terraform/modules/sbeacon.lambda-data-portal/package.py" "build" "--timestamp" "1750304485086757000" "builds/f9f60af32b15f107483d73c3d85d366ed15c32a6ec1c9212409a445be726e8f7.plan.json"]
module.sbeacon.module.lambda-indexer.null_resource.archive[0]: Creating...
module.sbeacon.module.python_modules_layer.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.python_modules_layer.null_resource.archive[0] (local-exec): Executing: ["python3" ".terraform/modules/sbeacon.python_modules_layer/package.py" "build" "--timestamp" "1750304484746220200" "builds/da4f8b664b5193994e1fb5583e6dc4eb1812b0438bf4f246d5847c460216eb58.plan.json"]
module.sbeacon.module.lambda-indexer.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): Executing: ["python3" ".terraform/modules/sbeacon.lambda-indexer/package.py" "build" "--timestamp" "1750304485973568000" "builds/aa624c03dfdae7cc1b6f9061e4ad7e5605e073652e2540f56756ee4171caf5db.plan.json"]
module.webgui.aws_s3_object.version: Modifications complete after 0s [id=version.txt]
module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0]: Creating...
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-getResultsURL.null_resource.archive[0] (local-exec): zip: creating 'builds/d2df92fff5a868bbdcaf874e61c535d70bbb9fa96753eef0590fbd1a82bdae0a.zip' archive
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-getResultsURL.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/203/default/pgxflow/pipeline_pharmcat/lambda/getResultsURL
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-getResultsURL.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-getResultsURL.null_resource.archive[0] (local-exec): Created: builds/d2df92fff5a868bbdcaf874e61c535d70bbb9fa96753eef0590fbd1a82bdae0a.zip
module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0]: Provisioning with 'local-exec'...
module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] (local-exec): Executing: ["python3" ".terraform/modules/cognito.lambda-sendRegistrationEmail/package.py" "build" "--timestamp" "1750304486236843200" "builds/0ab4695261445c275b666691d159b2827f1a283a9dbdb793347795a9ed72494d.plan.json"]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-getResultsURL.null_resource.archive[0]: Creation complete after 0s [id=5579737667269875883]
module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.null_resource.archive[0]: Creating...
module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.null_resource.archive[0]: Provisioning with 'local-exec'...
module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.null_resource.archive[0] (local-exec): Executing: ["python3" ".terraform/modules/pgxflow.pipeline_lookup.lambda-lookup/package.py" "build" "--timestamp" "1750304497787231000" "builds/53222f8ee608c84de7549e1709f1b8780e1237d60f44caf8c9a02f196239ecd7.plan.json"]
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): zip: creating 'builds/c10b05ac79a1543791452349cd94dc0becdd627b0c882c67a4f1c485c502d92c.zip' archive
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/203/default/sbeacon/lambda/getBiosamples
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): zip: adding: route_biosamples.py
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): zip: adding: route_biosamples_filtering_terms.py
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): zip: adding: route_biosamples_id.py
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): zip: adding: route_biosamples_id_analyses.py
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): zip: adding: route_biosamples_id_g_variants.py
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): zip: adding: route_biosamples_id_runs.py
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): Created: builds/c10b05ac79a1543791452349cd94dc0becdd627b0c882c67a4f1c485c502d92c.zip
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0]: Creation complete after 0s [id=6754102612046773008]
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): zip: creating 'builds/aa396856c56bc316f5429db8c17f42525a5333058192b85978c8cc8f4bb30bfe.zip' archive
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: creating 'builds/8c371ff12e5136df162e9fa7bcb5926be18d4b1fce0bfba3ac4489ef1eef43cf.zip' archive
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/203/default/sbeacon/lambda/getIndividuals
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding: route_individuals.py
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/203/default/sbeacon/lambda/getProjects
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding: route_individuals_filtering_terms.py
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding: route_individuals_id.py
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding: route_individuals_id_biosamples.py
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding: route_individuals_id_g_variants.py
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): zip: creating 'builds/aa624c03dfdae7cc1b6f9061e4ad7e5605e073652e2540f56756ee4171caf5db.zip' archive
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/203/default/sbeacon/lambda/indexer
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): zip: adding: USER_GUIDE.md
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): zip: adding: ctas_queries.py
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): zip: adding: utils/
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): zip: adding: utils/__init__.py
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): zip: adding: utils/models.py
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): Created: builds/aa396856c56bc316f5429db8c17f42525a5333058192b85978c8cc8f4bb30bfe.zip
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): zip: adding: generate_query_index.py
module.pgxflow[0].module.python_modules_layer.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): Created: builds/8c371ff12e5136df162e9fa7bcb5926be18d4b1fce0bfba3ac4489ef1eef43cf.zip
module.pgxflow[0].module.python_modules_layer.null_resource.archive[0]: Provisioning with 'local-exec'...
module.pgxflow[0].module.python_modules_layer.null_resource.archive[0] (local-exec): Executing: ["python3" ".terraform/modules/pgxflow.python_modules_layer/package.py" "build
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.